Revit 2026 API

# ViewSheetCreatePlaceholder Method

---

Creates a placeholder sheet in a document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ViewSheet CreatePlaceholder(
	Document aDoc
)
```
```vb
Public Shared Function CreatePlaceholder (
	aDoc As Document
) As ViewSheet
```
```cpp
public:
static ViewSheet^ CreatePlaceholder(
	Document^ aDoc
)
```
```fsharp
static member CreatePlaceholder :
        aDoc : Document -> ViewSheet
```

#### Parameters

aDoc Document
     The document.

#### Return Value

ViewSheet The placeholder sheet.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Placeholder sheets represent sheets stored outside of the Revit model, but which should be organized along with the Revit sheets.

#### Reference

ViewSheet Class

Autodesk.Revit.DB Namespace